// Вам потрібно створити простий календар, який може відображати місяці і дні.
//  Календар повинен мати можливість перегляду різних місяців та вибору конкретної дати.

// Основні вимоги:

// Календар повинен бути створений за допомогою HTML, CSS та JavaScript.

// На сторінці календаря повинен бути відображений поточний місяць, 
// включаючи назву місяця та рік.

// Календар повинен містити змінну кількість днів в місяці, враховуючи високосні роки.

// Календар повинен бути інтерактивним, тобто користувач може переглядати різні місяці 
// за допомогою кнопок "Наступний місяць" та "Попередній місяць".

// Календар повинен мати можливість виділяти дні, коли користувач клікає на них.
//  Виділені дні повинні відрізнятися візуально від інших днів.

// Повинна бути можливість вибрати конкретну дату (день) з календаря. 
// При виборі дати, вибраний день повинен бути виділений,
//  і його дата повинна бути збережена в змінній або виведена на сторінці.

// Додайте функціонал для перегляду подій або заміток для кожного дня. 
// При кліку на день, де є події або замітки, виведіть їх на сторінку.

// Оформлення календаря повинно бути привабливим та зручним для користувача.

// Додайте можливість переглядати календар в режимі "Місяць" та "Тиждень".
//  У режимі "Місяць" відображається повний місяць,
//  у режимі "Тиждень" - тільки тиждень з понеділка по неділю.

// Умови задачі по шагам:

// Для вирішення задачі надано три функції: stepOne, stepTwo та stepThree.
// Кожна функція повертає проміс зі змінною затримкою для імітації асинхронних операцій:
// stepOne повертає проміс, який резолвиться зі значенням 10 після 1 секунди.
// stepTwo отримує значення і повертає проміс, який резолвиться з результатом множення отриманого значення на 2 після 2 секунд.
// stepThree отримує значення і повертає проміс, який резолвиться з результатом додавання отриманого значення 5 після 1.5 секунди.
// Послідовно використовуючи методи then, результати кожної функції обробляються одна за одною:
// Результат функції stepOne передається в якості аргументу функції stepTwo.
// Результат функції stepTwo передається в якості аргументу функції stepThree.
// Результат функції stepThree виводиться в консоль разом із текстовим повідомленням "Результат останньої функції:".
// Якщо сталася помилка в будь-якій із функцій (режект проміса), вона буде виведена в консоль разом із текстовим повідомленням "Сталась помилка:".


// Завдання: Обробка послідовності промісів

// Створіть послідовність з трьох функцій, які повертають проміси і обробляють їх результати один за одним. Кожна функція повинна виконуватись з деякою затримкою для імітації асинхронності. Потім виведіть результат останньої функції у консоль.



function stepOne() {
    return new Promise((resolve) => {
        setTimeout(() => {
            resolve(10)
        }, 1000)
    })
}

function stepTwo(amount) {
    return new Promise((resolve) => {
        setTimeout(() => {
            resolve(amount * 2)
        }, 2000)
    })
}

function stepThree(amount) {
    return new Promise((resolve) => {
        setTimeout(() => {
            resolve(amount + 5)
        }, 1500)
    })
}

stepOne().then((result) => stepTwo(result)).then((result) => stepThree(result)).then((result) => console.log(result)).catch((error) => console.log(error))
stepOne().then(stepTwo).then(stepThree).then(console.log).catch(console.log)