// "Гра на вгадування слів або чисел":

// Користувач отримує випадкове слово або число, яке потрібно вгадати.
// Є обмежена кількість спроб (наприклад, 5 спроб) для вгадування правильного слова чи числа.
// Користувач може вводити свої варіанти відповіді через текстове поле або вікно введення.
// Після кожної спроби повідомляється користувачу, чи була відповідь правильною, чи ні.
// Якщо користувач вгадав слово чи число, гра завершується і повідомляється про перемогу. В іншому випадку, користувач може продовжити вгадування до вичерпання кількості спроб.

// Користувач має вгадати загадане випадкове число від 1 до 100. Він має 5 спроб на вгадування. При кожній спробі гра повідомляє користувачу, чи було введене число більше чи менше загаданого, і скільки спроб залишилось. Коли користувач вгадує число або вичерпує ліміт спроб, гра закінчується.